cmsis-svd/cmsis-svd/data/Atmel/ATSAML11E15A.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>IDAU</name>
         <version>U28031.0.0</version>
         <description>Implementation Defined Attribution Unit</description>
         <groupName>IDAU</groupName>
         <prependToName>IDAU_</prependToName>
         <baseAddress>0x41000000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xD</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>SECCTRL</name>
               <description>SECCTRL</description>
               <addressOffset>0x1</addressOffset>
               <size>8</size>
               <resetValue>0x03</resetValue>
               <fields>
                  <field>
                     <name>RXN</name>
                     <description>CPU RAM is eXecute Never</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCFGB</name>
               <description>SCFGB</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BS</name>
                     <description>Boot Secure</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>BNSC</name>
                     <description>Boot Secure, Non-secure Callable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>BOOTPROT</name>
                     <description>Boot Protection</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCFGA</name>
               <description>SCFGA</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AS</name>
                     <description>Application Secure</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ANSC</name>
                     <description>Application Secure, Non-secure Callable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>DS</name>
                     <description>DATAFLASH Data Secure</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCFGR</name>
               <description>SCFGR</description>
               <addressOffset>0xC</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>RS</name>
                     <description>RAM Secure</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>MCLK</name>
         <version>U22343.0.0</version>
         <description>Main Clock</description>
         <groupName>MCLK</groupName>
         <prependToName>MCLK_</prependToName>
         <baseAddress>0x40000800</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x20</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CTRLA</name>
               <description>Control</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>CKSEL</name>
                     <description>Clock Select</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENCLR</name>
               <description>Interrupt Enable Clear</description>
               <addressOffset>0x1</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>CKRDY</name>
                     <description>Clock Ready Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENSET</name>
               <description>Interrupt Enable Set</description>
               <addressOffset>0x2</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>CKRDY</name>
                     <description>Clock Ready Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTFLAG</name>
               <description>Interrupt Flag Status and Clear</description>
               <addressOffset>0x3</addressOffset>
               <size>8</size>
               <resetValue>0x01</resetValue>
               <fields>
                  <field>
                     <name>CKRDY</name>
                     <description>Clock Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CPUDIV</name>
               <description>CPU Clock Division</description>
               <addressOffset>0x4</addressOffset>
               <size>8</size>
               <resetValue>0x01</resetValue>
               <fields>
                  <field>
                     <name>CPUDIV</name>
                     <description>CPU Clock Division Factor</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>CPUDIVSelect</name>
                        <enumeratedValue>
                           <name>DIV1</name>
                           <description>Divide by 1</description>
                           <value>0x01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV2</name>
                           <description>Divide by 2</description>
                           <value>0x02</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV4</name>
                           <description>Divide by 4</description>
                           <value>0x04</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV8</name>
                           <description>Divide by 8</description>
                           <value>0x08</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV16</name>
                           <description>Divide by 16</description>
                           <value>0x10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV32</name>
                           <description>Divide by 32</description>
                           <value>0x20</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV64</name>
                           <description>Divide by 64</description>
                           <value>0x40</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV128</name>
                           <description>Divide by 128</description>
                           <value>0x80</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>AHBMASK</name>
               <description>AHB Mask</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <resetValue>0x00001FFF</resetValue>
               <fields>
                  <field>
                     <name>HPB0_</name>
                     <description>HPB0 AHB Clock Mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HPB1_</name>
                     <description>HPB1 AHB Clock Mask</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HPB2_</name>
                     <description>HPB2 AHB Clock Mask</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAC_</name>
                     <description>DMAC AHB Clock Mask</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSU_</name>
                     <description>DSU AHB Clock Mask</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PAC_</name>
                     <description>PAC AHB Clock Mask</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NVMCTRL_</name>
                     <description>NVMCTRL AHB Clock Mask</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRAM_</name>
                     <description>TRAM AHB Clock Mask</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>APBAMASK</name>
               <description>APBA Mask</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <resetValue>0x00007FFF</resetValue>
               <fields>
                  <field>
                     <name>PAC_</name>
                     <description>PAC APB Clock Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PM_</name>
                     <description>PM APB Clock Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCLK_</name>
                     <description>MCLK APB Clock Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RSTC_</name>
                     <description>RSTC APB Clock Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSCCTRL_</name>
                     <description>OSCCTRL APB Clock Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSC32KCTRL_</name>
                     <description>OSC32KCTRL APB Clock Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SUPC_</name>
                     <description>SUPC APB Clock Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GCLK_</name>
                     <description>GCLK APB Clock Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDT_</name>
                     <description>WDT APB Clock Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTC_</name>
                     <description>RTC APB Clock Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EIC_</name>
                     <description>EIC APB Clock Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FREQM_</name>
                     <description>FREQM APB Clock Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PORT_</name>
                     <description>PORT APB Clock Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AC_</name>
                     <description>AC APB Clock Enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>APBBMASK</name>
               <description>APBB Mask</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <resetValue>0x00000017</resetValue>
               <fields>
                  <field>
                     <name>IDAU_</name>
                     <description>IDAU APB Clock Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSU_</name>
                     <description>DSU APB Clock Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NVMCTRL_</name>
                     <description>NVMCTRL APB Clock Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>APBCMASK</name>
               <description>APBC Mask</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <resetValue>0x00001FFF</resetValue>
               <fields>
                  <field>
                     <name>EVSYS_</name>
                     <description>EVSYS APB Clock Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SERCOM0_</name>
                     <description>SERCOM0 APB Clock Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SERCOM1_</name>
                     <description>SERCOM1 APB Clock Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SERCOM2_</name>
                     <description>SERCOM2 APB Clock Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TC0_</name>
                     <description>TC0 APB Clock Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TC1_</name>
                     <description>TC1 APB Clock Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TC2_</name>
                     <description>TC2 APB Clock Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADC_</name>
                     <description>ADC APB Clock Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DAC_</name>
                     <description>DAC APB Clock Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PTC_</name>
                     <description>PTC APB Clock Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRNG_</name>
                     <description>TRNG APB Clock Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CCL_</name>
                     <description>CCL APB Clock Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OPAMP_</name>
                     <description>OPAMP APB Clock Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
