cmsis-svd/cmsis-svd/data/Atmel/ATSAML11E15A.svd
               <register>
                  <name>TAMPCTRL</name>
                  <description>Tamper Control</description>
                  <addressOffset>0x60</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>IN0ACT</name>
                        <description>Tamper Input 0 Action</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>IN0ACTSelect</name>
                           <enumeratedValue>
                              <name>OFF</name>
                              <description>Off (Disabled)</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>WAKE</name>
                              <description>Wake and set Tamper flag</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CAPTURE</name>
                              <description>Capture timestamp and set Tamper flag</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ACTL</name>
                              <description>Compare IN0 to OUT. When a mismatch occurs, capture timestamp and set Tamper flag</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>IN1ACT</name>
                        <description>Tamper Input 1 Action</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>IN1ACTSelect</name>
                           <enumeratedValue>
                              <name>OFF</name>
                              <description>Off (Disabled)</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>WAKE</name>
                              <description>Wake and set Tamper flag</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CAPTURE</name>
                              <description>Capture timestamp and set Tamper flag</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ACTL</name>
                              <description>Compare IN1 to OUT. When a mismatch occurs, capture timestamp and set Tamper flag</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>IN2ACT</name>
                        <description>Tamper Input 2 Action</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>IN2ACTSelect</name>
                           <enumeratedValue>
                              <name>OFF</name>
                              <description>Off (Disabled)</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>WAKE</name>
                              <description>Wake and set Tamper flag</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CAPTURE</name>
                              <description>Capture timestamp and set Tamper flag</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ACTL</name>
                              <description>Compare IN2 to OUT. When a mismatch occurs, capture timestamp and set Tamper flag</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>IN3ACT</name>
                        <description>Tamper Input 3 Action</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>IN3ACTSelect</name>
                           <enumeratedValue>
                              <name>OFF</name>
                              <description>Off (Disabled)</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>WAKE</name>
                              <description>Wake and set Tamper flag</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CAPTURE</name>
                              <description>Capture timestamp and set Tamper flag</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ACTL</name>
                              <description>Compare IN3 to OUT. When a mismatch occurs, capture timestamp and set Tamper flag</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>TAMLVL0</name>
                        <description>Tamper Level Select 0</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TAMLVL1</name>
                        <description>Tamper Level Select 1</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TAMLVL2</name>
                        <description>Tamper Level Select 2</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TAMLVL3</name>
                        <description>Tamper Level Select 3</description>
                        <bitOffset>19</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DEBNC0</name>
                        <description>Debouncer Enable 0</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DEBNC1</name>
                        <description>Debouncer Enable 1</description>
                        <bitOffset>25</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DEBNC2</name>
                        <description>Debouncer Enable 2</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DEBNC3</name>
                        <description>Debouncer Enable 3</description>
                        <bitOffset>27</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>TIMESTAMP</name>
                  <description>MODE2 Timestamp</description>
                  <addressOffset>0x64</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>SECOND</name>
                        <description>Second Timestamp Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                     <field>
                        <name>MINUTE</name>
                        <description>Minute Timestamp Value</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                     <field>
                        <name>HOUR</name>
                        <description>Hour Timestamp Value</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>5</bitWidth>
                     </field>
                     <field>
                        <name>DAY</name>
                        <description>Day Timestamp Value</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>5</bitWidth>
                     </field>
                     <field>
                        <name>MONTH</name>
                        <description>Month Timestamp Value</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>YEAR</name>
                        <description>Year Timestamp Value</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>TAMPID</name>
                  <description>Tamper ID</description>
                  <addressOffset>0x68</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>TAMPID0</name>
                        <description>Tamper Input 0 Detected</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TAMPID1</name>
                        <description>Tamper Input 1 Detected</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TAMPID2</name>
                        <description>Tamper Input 2 Detected</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TAMPID3</name>
                        <description>Tamper Input 3 Detected</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TAMPEVT</name>
                        <description>Tamper Event Detected</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>TAMPCTRLB</name>
                  <description>Tamper Control B</description>
                  <addressOffset>0x6C</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>ALSI0</name>
                        <description>Active Layer Select Internal 0</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ALSI1</name>
                        <description>Active Layer Select Internal 1</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ALSI2</name>
                        <description>Active Layer Select Internal 2</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ALSI3</name>
                        <description>Active Layer Select Internal 3</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
